
`{"tf":"plan","chdir":"sample_bucket","backend-config":"backend/dev.tfbackend"}`
<details><summary>Diff of format changes.</summary>

  ```diff
  main.tf
--- old/main.tf
+++ new/main.tf
@@ -9,6 +9,6 @@
 # Output the ID of the sample S3 bucket.
 output "sample_bucket_id" {
   description = "ID of the sample S3 bucket."
-  value        = module.sample_bucket.id
+  value       = module.sample_bucket.id
 }
 
  ```
  </details>
<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

###### TF Via PR Comments by @rdhar via [issue_comment](https://github.com/devsectop/tf-via-pr/actions/runs/6883157278) at 2023-11-15T21:31:48Z.</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sample_bucket.aws_s3_bucket.sample will be created
  + resource "aws_s3_bucket" "sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "unique"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "unique-bucket"
        }
      + tags_all                    = {
          + "Name"      = "unique-bucket"
          + "Stack"     = "sample_bucket"
          + "Terraform" = "default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.aws_s3_bucket_versioning.sample will be created
  + resource "aws_s3_bucket_versioning" "sample" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)
```
</details>
<!-- 166backend-dev-tfbackendstacks-sample-bucket-tfplan -->